import os

# ===================== BOT =====================
BOT_TOKEN = os.getenv("BOT_TOKEN")

# ===================== ADMINS =====================
# IDs حسابات الأدمن (مش الرولات)
ADMIN_IDS = [
    802148738939748373
]

# ===================== ROLES =====================
# رول الأدمن (اللي يقدر يقبل/يرفض/يضيف رصيد)
ADMIN_ROLE_ID = 1292973462091989155

# رول الدعم (يستخدم a-role / e-role / a-sale / e-sale)
SUPPORT_ROLE_ID = 1468746308780294266

# ===================== CHANNELS =====================

# روم الإيداع (Slash /deposit فقط)
DEPOSIT_CHANNEL_ID = 1292971040489603156

# روم التداول
TRADE_CHANNEL_ID = 1292970481976217732

# 🔴 روم التسليم (تظهر فيه:
# - إثبات التحويل
# - Embed الطلب
# - أزرار Confirm / Reject)
ADMIN_ACTION_CHANNEL_ID = 1293008901142351952

# 🟡 روم اللوج (تتحفظ فيه:
# - تم قبول شحن
# - تم رفض شحن
# - تفعيل / انتهاء رولات)
LOG_CHANNEL_ID = 1293146723417587763

# لوج الرولات (نفس روم اللوج)
ROLE_LOG_CHANNEL_ID = 1293146723417587763

# ===================== PAYMENTS =====================
VODAFONE_NUMBER = "01009137618"
INSTAPAY_NUMBER = "01124808116"

# ===================== PROBOT =====================
PROBOT_ID = 802148738939748373
PROBOT_OWNER_ID = 802148738939748373

# نسبة خصم بروبوت (5.3%)
PROBOT_FEE_RATE = 0.053

# ===================== TRADING SETTINGS =====================
MIN_BET = 5000
MAX_BET = 100000

BASE_WIN_RATE = 0.55
COOLDOWN_SECONDS = 60
BIG_TRADE_AMOUNT = 50000

# ===================== DATA FILES =====================
DATA_FILE = "data/deposits.json"
